experiment_data/ycsb/Tapir/run-rper50-hst3-srv9-thr1-this2.log
YCSB Client 0.1
Command line: -P workloads/workload50 -t -db com.yahoo.ycsb.db.TapirClient -p tapir.configpath=../store/tools/shard -p tapir.nshards=8 -p tapir.closestreplica=2 -p measurement.type=histogram -p histogram.buckets=25 -threads 1 -p operationcount=300000
Loading workload...
Starting test.
Database validation succeeded
[OVERALL], RunTime(ms), 393990.0
[OVERALL], Throughput(ops/sec), 761.4406457016676
[READ], Operations, 149989
[READ], AverageLatency(us), 224.07983252105154
[READ], MinLatency(us), 158
[READ], MaxLatency(us), 15849
[READ], 95thPercentileLatency(ms), 0
[READ], 99thPercentileLatency(ms), 0
[READ], Return=0, 149989
[READ], 0, 149965
[READ], 1, 16
[READ], 2, 0
[READ], 3, 0
[READ], 4, 4
[READ], 5, 0
[READ], 6, 0
[READ], 7, 1
[READ], 8, 2
[READ], 9, 0
[READ], 10, 0
[READ], 11, 0
[READ], 12, 0
[READ], 13, 0
[READ], 14, 0
[READ], 15, 1
[READ], 16, 0
[READ], 17, 0
[READ], 18, 0
[READ], 19, 0
[READ], 20, 0
[READ], 21, 0
[READ], 22, 0
[READ], 23, 0
[READ], 24, 0
[READ], >25, 0
[COMMIT], Operations, 300000
[COMMIT], AverageLatency(us), 1078.4631666666667
[COMMIT], MinLatency(us), 1010
[COMMIT], MaxLatency(us), 502912
[COMMIT], 95thPercentileLatency(ms), 1
[COMMIT], 99thPercentileLatency(ms), 1
[COMMIT], Return=0, 300000
[COMMIT], 0, 0
[COMMIT], 1, 299588
[COMMIT], 2, 123
[COMMIT], 3, 85
[COMMIT], 4, 38
[COMMIT], 5, 12
[COMMIT], 6, 151
[COMMIT], 7, 0
[COMMIT], 8, 1
[COMMIT], 9, 1
[COMMIT], 10, 0
[COMMIT], 11, 0
[COMMIT], 12, 0
[COMMIT], 13, 0
[COMMIT], 14, 0
[COMMIT], 15, 0
[COMMIT], 16, 0
[COMMIT], 17, 0
[COMMIT], 18, 0
[COMMIT], 19, 0
[COMMIT], 20, 0
[COMMIT], 21, 0
[COMMIT], 22, 0
[COMMIT], 23, 0
[COMMIT], 24, 0
[COMMIT], >25, 1
[START], Operations, 300000
[START], AverageLatency(us), 1.0060533333333332
[START], MinLatency(us), 0
[START], MaxLatency(us), 141
[START], 95thPercentileLatency(ms), 0
[START], 99thPercentileLatency(ms), 0
[START], Return=0, 300000
[START], 0, 300000
[START], 1, 0
[START], 2, 0
[START], 3, 0
[START], 4, 0
[START], 5, 0
[START], 6, 0
[START], 7, 0
[START], 8, 0
[START], 9, 0
[START], 10, 0
[START], 11, 0
[START], 12, 0
[START], 13, 0
[START], 14, 0
[START], 15, 0
[START], 16, 0
[START], 17, 0
[START], 18, 0
[START], 19, 0
[START], 20, 0
[START], 21, 0
[START], 22, 0
[START], 23, 0
[START], 24, 0
[START], >25, 0
[UPDATE], Operations, 150011
[UPDATE], AverageLatency(us), 233.8026211411163
[UPDATE], MinLatency(us), 165
[UPDATE], MaxLatency(us), 7812
[UPDATE], 95thPercentileLatency(ms), 0
[UPDATE], 99thPercentileLatency(ms), 0
[UPDATE], Return=0, 150011
[UPDATE], 0, 149970
[UPDATE], 1, 21
[UPDATE], 2, 9
[UPDATE], 3, 5
[UPDATE], 4, 2
[UPDATE], 5, 1
[UPDATE], 6, 1
[UPDATE], 7, 2
[UPDATE], 8, 0
[UPDATE], 9, 0
[UPDATE], 10, 0
[UPDATE], 11, 0
[UPDATE], 12, 0
[UPDATE], 13, 0
[UPDATE], 14, 0
[UPDATE], 15, 0
[UPDATE], 16, 0
[UPDATE], 17, 0
[UPDATE], 18, 0
[UPDATE], 19, 0
[UPDATE], 20, 0
[UPDATE], 21, 0
[UPDATE], 22, 0
[UPDATE], 23, 0
[UPDATE], 24, 0
[UPDATE], >25, 0