experiment_data/ycsb/Tapir/run-rper50-hst3-srv9-thr3-this1.log
YCSB Client 0.1
Command line: -P workloads/workload50 -t -db com.yahoo.ycsb.db.TapirClient -p tapir.configpath=../store/tools/shard -p tapir.nshards=8 -p tapir.closestreplica=1 -p measurement.type=histogram -p histogram.buckets=25 -threads 3 -p operationcount=300000
Loading workload...
Starting test.
Database validation succeeded
[OVERALL], RunTime(ms), 113989.0
[OVERALL], Throughput(ops/sec), 2631.8328961566467
[READ], Operations, 149963
[READ], AverageLatency(us), 313.8614858331722
[READ], MinLatency(us), 147
[READ], MaxLatency(us), 5935
[READ], 95thPercentileLatency(ms), 0
[READ], 99thPercentileLatency(ms), 0
[READ], Return=0, 149963
[READ], 0, 149759
[READ], 1, 187
[READ], 2, 10
[READ], 3, 2
[READ], 4, 2
[READ], 5, 3
[READ], 6, 0
[READ], 7, 0
[READ], 8, 0
[READ], 9, 0
[READ], 10, 0
[READ], 11, 0
[READ], 12, 0
[READ], 13, 0
[READ], 14, 0
[READ], 15, 0
[READ], 16, 0
[READ], 17, 0
[READ], 18, 0
[READ], 19, 0
[READ], 20, 0
[READ], 21, 0
[READ], 22, 0
[READ], 23, 0
[READ], 24, 0
[READ], >25, 0
[COMMIT], Operations, 300000
[COMMIT], AverageLatency(us), 808.9889133333334
[COMMIT], MinLatency(us), 664
[COMMIT], MaxLatency(us), 502331
[COMMIT], 95thPercentileLatency(ms), 0
[COMMIT], 99thPercentileLatency(ms), 1
[COMMIT], Return=0, 300000
[COMMIT], 0, 293512
[COMMIT], 1, 6011
[COMMIT], 2, 101
[COMMIT], 3, 36
[COMMIT], 4, 142
[COMMIT], 5, 190
[COMMIT], 6, 3
[COMMIT], 7, 1
[COMMIT], 8, 2
[COMMIT], 9, 1
[COMMIT], 10, 0
[COMMIT], 11, 0
[COMMIT], 12, 0
[COMMIT], 13, 0
[COMMIT], 14, 0
[COMMIT], 15, 0
[COMMIT], 16, 0
[COMMIT], 17, 0
[COMMIT], 18, 0
[COMMIT], 19, 0
[COMMIT], 20, 0
[COMMIT], 21, 0
[COMMIT], 22, 0
[COMMIT], 23, 0
[COMMIT], 24, 0
[COMMIT], >25, 1
[START], Operations, 300000
[START], AverageLatency(us), 0.95423
[START], MinLatency(us), 0
[START], MaxLatency(us), 701
[START], 95thPercentileLatency(ms), 0
[START], 99thPercentileLatency(ms), 0
[START], Return=0, 300000
[START], 0, 300000
[START], 1, 0
[START], 2, 0
[START], 3, 0
[START], 4, 0
[START], 5, 0
[START], 6, 0
[START], 7, 0
[START], 8, 0
[START], 9, 0
[START], 10, 0
[START], 11, 0
[START], 12, 0
[START], 13, 0
[START], 14, 0
[START], 15, 0
[START], 16, 0
[START], 17, 0
[START], 18, 0
[START], 19, 0
[START], 20, 0
[START], 21, 0
[START], 22, 0
[START], 23, 0
[START], 24, 0
[START], >25, 0
[UPDATE], Operations, 150037
[UPDATE], AverageLatency(us), 324.0583855982191
[UPDATE], MinLatency(us), 160
[UPDATE], MaxLatency(us), 9122
[UPDATE], 95thPercentileLatency(ms), 0
[UPDATE], 99thPercentileLatency(ms), 0
[UPDATE], Return=0, 150037
[UPDATE], 0, 149835
[UPDATE], 1, 173
[UPDATE], 2, 16
[UPDATE], 3, 7
[UPDATE], 4, 2
[UPDATE], 5, 1
[UPDATE], 6, 2
[UPDATE], 7, 0
[UPDATE], 8, 0
[UPDATE], 9, 1
[UPDATE], 10, 0
[UPDATE], 11, 0
[UPDATE], 12, 0
[UPDATE], 13, 0
[UPDATE], 14, 0
[UPDATE], 15, 0
[UPDATE], 16, 0
[UPDATE], 17, 0
[UPDATE], 18, 0
[UPDATE], 19, 0
[UPDATE], 20, 0
[UPDATE], 21, 0
[UPDATE], 22, 0
[UPDATE], 23, 0
[UPDATE], 24, 0
[UPDATE], >25, 0